njreichert/cdh-tsat6/cdh-tsat6-stm32project-nucleo/Core/Src/Si446x/Si446x.c
/*
 * Project: Si4463 Radio Library for AVR and Arduino
 * Author: Zak Kemble, contact@zakkemble.co.uk
 * Copyright: (C) 2017 by Zak Kemble
 * License: GNU GPL v3 (see License.txt)
 * Web: http://blog.zakkemble.co.uk/si4463-radio-library-avr-arduino/
 */

#include "stm32l4xx_hal.h" // Allows for usage of STM32 HAL-Specific functions, like HAL_Delay().

#include <string.h>
#include <stdint.h>
#include "Si446x/Si446x_spi.h"
#include "Si446x/Si446x.h"
#include "Si446x/Si446x_config.h"
#include "Si446x/Si446x_defs.h"
#include "Si446x/radio_config.h"


#define IDLE_STATE SI446X_IDLE_MODE

// When FIFOs are combined it becomes a 129 byte FiFO
// The first byte is used for length, then the remaining 128 bytes for the packet data
#define MAX_PACKET_LEN			SI446X_MAX_PACKET_LEN

#define IRQ_PACKET				0
#define IRQ_MODEM				1
#define IRQ_CHIP				2

#define rssi_dBm(val)			((val / 2) - 134)


// TODO: Redefine appropriately for STM32 -NJR
#if SI446X_INTERRUPTS != 0
	#if defined(ARDUINO) && SI446X_IRQ == -1
		#error "SI446X_INTERRUPTS is 1, but SI446X_IRQ is set to -1!"
	#elif !defined(ARDUINO) && !defined(IRQ_BIT)
		#error "SI446X_INTERRUPTS is 1, but SI446X_IRQ_PORT or SI446X_IRQ_BIT has not been set!"
	#endif
#endif

// TODO: Move this code to a different file, like "Si446x_utils"?
#define	delay_ms(ms)			HAL_Delay(ms);

static const uint8_t config[] = RADIO_CONFIGURATION_DATA_ARRAY;

static volatile uint8_t enabledInterrupts[3];

// http://stackoverflow.com/questions/10802324/aliasing-a-function-on-a-c-interface-within-a-c-application-on-linux
#if defined(__cplusplus)
extern "C" {
#endif
	static void __empty_callback0(void){}
	static void __empty_callback1(int16_t param1){(void)(param1);}
#if defined(__cplusplus)
}
#endif
// TODO: Figure out what these do -NJR
void __attribute__((weak, alias ("__empty_callback0"))) SI446X_CB_CMDTIMEOUT(void);
void __attribute__((weak, alias ("__empty_callback1"))) SI446X_CB_RXBEGIN(int16_t rssi);
void __attribute__((weak)) SI446X_CB_RXCOMPLETE(uint8_t length, int16_t rssi){(void)(length);(void)(rssi);}
void __attribute__((weak, alias ("__empty_callback1"))) SI446X_CB_RXINVALID(int16_t rssi);
void __attribute__((weak, alias ("__empty_callback0"))) SI446X_CB_SENT(void);
void __attribute__((weak, alias ("__empty_callback0"))) SI446X_CB_WUT(void);
void __attribute__((weak, alias ("__empty_callback0"))) SI446X_CB_LOWBATT(void);
#if SI446X_ENABLE_ADDRMATCHING
void __attribute__((weak, alias ("__empty_callback0"))) SI446X_CB_ADDRMATCH(void);
void __attribute__((weak, alias ("__empty_callback0"))) SI446X_CB_ADDRMISS(void);
#endif

// TODO
//void __attribute__((weak)) SI446X_CB_DEBUG(uint8_t* interrupts){(void)(interrupts);}

// http://www.nongnu.org/avr-libc/user-manual/atomic_8h_source.html


// Start of the Interrupt setup routine. Mainly what needs to be done is setting the correct IRQ Port and bit, and figuring out what the counter logic in this #ifdef block does. -NJR
#if defined(ARDUINO) || defined(STM32L452xx)

#if SI446X_INTERRUPTS != 0
// It's not possible to get the current interrupt enabled state in Arduino (SREG only works for AVR based Arduinos, and no way of getting attachInterrupt() status), so we use a counter thing instead
static volatile uint8_t isrState_local;
#endif

#if SI446X_INTERRUPTS == 1 || SI446X_INT_SPI_COMMS == 1
static volatile uint8_t isrState;
static volatile uint8_t isrBusy; // Don't mess with global interrupts if we're inside an ISR

static inline uint8_t interrupt_off(void)
{
	if(!isrBusy)
	{
#if defined(ARDUINO)
		noInterrupts();
#elif defined(STM32L452xx)
        __disable_irq();
#endif
		isrState++;
	}
	return 1;
}

static inline uint8_t interrupt_on(void)
{
	if(!isrBusy)
	{
		if(isrState > 0)
			isrState--;
		if(isrState == 0)
#if defined(ARDUINO)
			interrupts();
#elif defined(STM32L452xx)
            __enable_irq();
#endif
	}
	return 0;
}
#endif

#endif

// TODO
// 2 types of interrupt blocks
// Local (SI446X_NO_INTERRUPT()): Disables the pin interrupt so the ISR does not run while normal code is busy in the Si446x code, however another interrupt can enter the code which would be bad.
// Global (SI446X_ATOMIC()): Disable all interrupts, don't use waitForResponse() inside here as it can take a while to complete. These blocks are to make sure no other interrupts use the SPI bus.

// If an interrupt might do some SPI communications with another device then we
// need to turn global interrupts off while communicating with the radio.
// Otherwise, just turn off our own radio interrupt while doing SPI stuff.

// TODO: Figure out if this is going to cause problems later. -NJR
#if SI446X_INTERRUPTS == 0 && SI446X_INT_SPI_COMMS == 0
#define SI446X_ATOMIC() ((void)(0));
#elif defined(ARDUINO) || defined(STM32L452xx)
#define SI446X_ATOMIC() for(uint8_t _cs2 = interrupt_off(); _cs2; _cs2 = interrupt_on())
#else
#define SI446X_ATOMIC()	ATOMIC_BLOCK(ATOMIC_RESTORESTATE) // ATOMIC_BLOCK is an AVR Extension.
#endif

// When doing SPI comms with the radio or doing multiple commands we don't want the radio interrupt to mess it up.
uint8_t Si446x_irq_off()
{
#if SI446X_INTERRUPTS != 0

#if defined(ARDUINO) || defined(STM32L452xx)
#if defined(ARDUINO)
	detachInterrupt(digitalPinToInterrupt(SI446X_IRQ));
#elif defined(STM32L452xx)
	HAL_NVIC_DisableIRQ(STM_IRQ_LINE);
#endif
	isrState_local++;
	return 0;
#else
	uint8_t origVal = SI446X_REG_EXTERNAL_INT;
	SI446X_REG_EXTERNAL_INT &= ~_BV(SI446X_BIT_EXTERNAL_INT);
	origVal = !!(origVal & _BV(SI446X_BIT_EXTERNAL_INT));
	//origVal += 1; // We always want to return a non-zero value so the for() loop will loop TODO
	return origVal;
#endif

#else
	return 0;
#endif
}

// Probably would be easier for now to Re-implement the arduino section as STM32 HAL function calls, since this is not necessarily timing-sensitive? -NJR
void Si446x_irq_on(uint8_t origVal)
{
#if SI446X_INTERRUPTS != 0

#if defined(ARDUINO) || defined(STM32L452xx)
	((void)(origVal));
	if(isrState_local > 0)
		isrState_local--;
	if(isrState_local == 0)

#if defined(ARDUINO)
		attachInterrupt(digitalPinToInterrupt(SI446X_IRQ), Si446x_SERVICE, FALLING);
#else // Assuming defined(STM32L452xx)
		HAL_NVIC_EnableIRQ(STM_IRQ_LINE);
#endif
#else
	if(origVal)// == 2) TODO
		SI446X_REG_EXTERNAL_INT |= _BV(SI446X_BIT_EXTERNAL_INT);
#endif

#else
	((void)(origVal));
#endif
}


/* TODO: I apologise in advance to whomever wants to sort this out. -NJR */
// A replacement for getResponse and waitForResponse.
static uint8_t receiveResponse(void* buff, uint8_t len)
{

