njreichert/cdh-tsat6/cdh-tsat6-stm32project-nucleo/Core/Src/Si446x/Si446x.c
/*
// TODO
// External version of interrupt()
void Si446x_interrupt(uint8_t* buff)
{
	uint8_t data[4] = {SI446X_CMD_GET_INT_STATUS, 0xff, 0xff, 0xff};
	doAPI(&data, sizeof(data), buff, 8);
}
*/

// Apply the radio configuration
static void applyStartupConfig(void)
{
	uint8_t buff[17];
	for(uint16_t i=0;i<sizeof(config);i++)
	{
		memcpy(buff, &config[i], sizeof(buff));
		doAPI(&buff[1], buff[0], NULL, 0);
		i += buff[0];
	}
}

void Si446x_init()
{
	cdeselect();

	/* Ensure by this point interrupts and relevant GPIOs are enabled. */
	// gpio_init();

	/*
	#ifdef IRQ_BIT
		// Interrupt pin (input with pullup)
	#if defined(PUEA) || defined(PUEB) || defined(PUEC) || defined(PUED) || defined(PUEE)
		IRQ_PUE |= _BV(IRQ_BIT);
	#else
		IRQ_PORT |= _BV(IRQ_BIT);
	#endif
	#endif
	*/

	/* Ensure by this point SPI is enabled. */
	// spi_init();

	resetDevice();
	applyStartupConfig();
	interrupt(NULL);
	Si446x_sleep();

	enabledInterrupts[IRQ_PACKET] = (1<<SI446X_PACKET_RX_PEND) | (1<<SI446X_CRC_ERROR_PEND);
	//enabledInterrupts[IRQ_MODEM] = (1<<SI446X_SYNC_DETECT_PEND);

	/* We need a way to be able to take GPIO Interrupts, and turn them off for a certain amount of time. should be doable. */
	Si446x_irq_on(1);
}

void Si446x_getInfo(si446x_info_t* info)
{
	uint8_t data[8] = {
		SI446X_CMD_PART_INFO
	};
	doAPI(data, 1, data, 8);

	info->chipRev	= data[0];
	info->part		= (data[1]<<8) | data[2];
	info->partBuild	= data[3];
	info->id		= (data[4]<<8) | data[5];
	info->customer	= data[6];
	info->romId		= data[7];

	data[0] = SI446X_CMD_FUNC_INFO;
	doAPI(data, 1, data, 6);

	info->revExternal	= data[0];
	info->revBranch		= data[1];
	info->revInternal	= data[2];
	info->patch			= (data[3]<<8) | data[4];
	info->func			= data[5];
}

int16_t Si446x_getRSSI()
{
	uint8_t data[3] = {
		SI446X_CMD_GET_MODEM_STATUS,
		0xFF
	};
	doAPI(data, 2, data, 3);
	int16_t rssi = rssi_dBm(data[2]);
	return rssi;
}

si446x_state_t Si446x_getState()
{
	// TODO what about the state change delay with transmitting?
	return getState();
}

void Si446x_setTxPower(uint8_t pwr)
{
	setProperty(SI446X_PA_PWR_LVL, pwr);
}

#if SI446X_ENABLE_ADDRMATCHING
// API docs say that you can match on the same byte, but programming guide says you can't!
// Truth is that you can't match on the same byte (that means broadcast flag needs to be on a separate byte than the address :/)
void Si446x_setAddress(si446x_addrMode_t mode, uint8_t address)
{
	uint8_t data[] = {
		address,
		0xFF,
		SI446X_MATCH_EN | 1,

		0x80,
		0x80,
		2,

		0x00,
		0x00,
		3,

		0x00,
		0x00,
		4
	};

	if(mode == SI446X_ADDRMODE_DISABLE) // Set everything to 0 to disable address matching
		memset(data, 0, sizeof(data));
	else if(mode == SI446X_ADDRMODE_ADDR) // Disable matching for the 2nd byte
	{
		data[3] = 0x00;
		data[4] = 0x00;
	}

	setProperties(SI446X_MATCH_VALUE_1, data, sizeof(data));
}
#endif

void Si446x_setLowBatt(uint16_t voltage)
{
	// voltage should be between 1500 and 3050
	uint8_t batt = (voltage / 50) - 30;//((voltage * 2) - 3000) / 100;
	setProperty(SI446X_GLOBAL_LOW_BATT_THRESH, batt);
}

void Si446x_setupWUT(uint8_t r, uint16_t m, uint8_t ldc, uint8_t config)
{
	// Maximum value of r is 20
	
	// The API docs say that if r or m are 0, then they will have the same effect as if they were 1, but this doesn't seem to be the case?

	// Check valid config
	// TODO needed?
	if(!(config & (SI446X_WUT_RUN | SI446X_WUT_BATT | SI446X_WUT_RX)))
		return;

	SI446X_NO_INTERRUPT()
	{
		// Disable WUT
		setProperty(SI446X_GLOBAL_WUT_CONFIG, 0);

		uint8_t doRun = !!(config & SI446X_WUT_RUN);
		uint8_t doBatt = !!(config & SI446X_WUT_BATT);
		uint8_t doRx = (config & SI446X_WUT_RX);

		// Setup WUT interrupts
		uint8_t intChip = 0;//getProperty(SI446X_INT_CTL_CHIP_ENABLE); // No other CHIP interrupts are enabled so dont bother reading the current state
		//intChip &= ~((1<<SI446X_INT_CTL_CHIP_LOW_BATT_EN)|(1<<SI446X_INT_CTL_CHIP_WUT_EN));
		intChip |= doBatt<<SI446X_INT_CTL_CHIP_LOW_BATT_EN;
		intChip |= doRun<<SI446X_INT_CTL_CHIP_WUT_EN;
		enabledInterrupts[IRQ_CHIP] = intChip;
		setProperty(SI446X_INT_CTL_CHIP_ENABLE, intChip);

		// Set WUT clock source to internal 32KHz RC
		if(getProperty(SI446X_GLOBAL_CLK_CFG) != SI446X_DIVIDED_CLK_32K_SEL_RC)
		{
			setProperty(SI446X_GLOBAL_CLK_CFG, SI446X_DIVIDED_CLK_32K_SEL_RC);
			delay_ms(3); // Need to wait [3 ms] for clock source to stabilize, see GLOBAL_WUT_CONFIG:WUT_EN info
		}

		// Setup WUT
		uint8_t properties[5];
		properties[0] = doRx ? SI446X_GLOBAL_WUT_CONFIG_WUT_LDC_EN_RX : 0;
		properties[0] |= doBatt<<SI446X_GLOBAL_WUT_CONFIG_WUT_LBD_EN;
		properties[0] |= (1<<SI446X_GLOBAL_WUT_CONFIG_WUT_EN);
		properties[1] = m>>8;
		properties[2] = m;
		properties[3] = r | SI446X_LDC_MAX_PERIODS_TWO | (1<<SI446X_WUT_SLEEP);
		properties[4] = ldc;
		setProperties(SI446X_GLOBAL_WUT_CONFIG, properties, sizeof(properties));
	}
}

void Si446x_disableWUT()
{
	SI446X_NO_INTERRUPT()
	{
		setProperty(SI446X_GLOBAL_WUT_CONFIG, 0);
		setProperty(SI446X_GLOBAL_CLK_CFG, 0);
	}
}

// TODO
// ADDRESS MATCH (only useful with address mode on)
// ADDRESS MISS (only useful with address mode on)
// PACKET SENT
// PACKET RX (must never be turned off, otherwise RX mode would be pointless)
// PACKET RX INVALID (must never be turned off, otherwise RX mode would be pointless)
// PACKET BEGIN (SYNC, modem)
// WUT and LOWBATT (cant turn off/on from here, use wutSetup instead)
// INVALID SYNC (the fix thing)
void Si446x_setupCallback(uint16_t callbacks, uint8_t state)
{
	SI446X_NO_INTERRUPT()
	{
		uint8_t data[2];
		getProperties(SI446X_INT_CTL_PH_ENABLE, data, sizeof(data));

		if(state)
		{
			data[0] |= callbacks>>8;
			data[1] |= callbacks;
		}
		else
		{
			data[0] &= ~(callbacks>>8);
			data[1] &= ~callbacks;
		}
		
		// TODO
		// make sure RXCOMPELTE, RXINVALID and RXBEGIN? are always enabled

		enabledInterrupts[IRQ_PACKET] = data[0];
		enabledInterrupts[IRQ_MODEM] = data[1];
		setProperties(SI446X_INT_CTL_PH_ENABLE, data, sizeof(data));
	}
/*
	// TODO remove
	uint8_t data[4];
	data[0] = 0xFF;
	data[1] = 0b11111100;
	data[2] = 0b11111011;
	data[3] = 0xff;
	setProperties(SI446X_INT_CTL_ENABLE, data, sizeof(data));
*/
}

uint8_t Si446x_sleep()
{
	if(getState() == SI446X_STATE_TX)
		return 0;
	setState(SI446X_STATE_SLEEP);
	return 1;
}

void Si446x_read(void* buff, uint8_t len)
{
	// SI446X_ATOMIC()
	// {
		CHIPSELECT()
		{
			spi_transfer(SI446X_CMD_READ_RX_FIFO); // removed _nr -NJR
			for(uint8_t i=0;i<len;i++)
				((uint8_t*)buff)[i] = spi_transfer(0xFF);
		}
	// }
}
/*
// TODO maybe
void Si446x_write(void* buff, uint8_t len)
{
	// if we are going to do this then we need dual FIFO so we can stay in RX mode while filling TX FIFO
	// also need a public clearFIFO for TX and RX
	// this will also allow multiple transmissions without writing FIFO again
	// however, we wont know if the packet is corrupt until the whole thing has been transmitted/received - might run out of memory if its a large packet, unless its written to some external SPI RAM as its being received

	SI446X_ATOMIC()
	{
		// Load data to FIFO
		CHIPSELECT()
		{
			spi_transfer_nr(SI446X_CMD_WRITE_TX_FIFO);
			for(uint8_t i=0;i<len;i++)
				spi_transfer_nr(((uint8_t*)buff)[i]);
		}
	}
}
*/

#include <stdio.h>

