njreichert/cdh-tsat6/cdh-tsat6-stm32project-nucleo/Core/Src/Si446x/Si446x.c
// Note for future - Possible error cases:
// - Packet size not between 1 and 128 bytes.
// - Device not ready to send - already transmitting?

uint8_t Si446x_TX(void* packet, uint8_t len, uint8_t channel, si446x_state_t onTxFinish)
{


#if SI446X_FIXED_LENGTH
	// Stop the unused parameter warning
	((void)(len));
#endif

	 SI446X_NO_INTERRUPT()
	 {
		if (getState() == SI446X_STATE_TX) { // Already transmitting
			return 0;
		}

		// Check for bad packet size.
#if !SI446X_FIXED_LENGTH // What if this is hard-coded to a bad value by accident?
		if (len == 0 || len > 128) {
			return 0; // See comment at start of function.
		}
#endif

		// TODO collision avoid or maybe just do collision detect (RSSI jump)

		setState(IDLE_STATE);
		clearFIFO();
		interrupt2(NULL, 0, 0, 0xFF);

		// SI446X_ATOMIC()
		// {
			// Load data to FIFO
			CHIPSELECT()
			{ // All spi_transfers in this block replace spi_transfer_nr
				spi_transfer(SI446X_CMD_WRITE_TX_FIFO);
#if !SI446X_FIXED_LENGTH
				spi_transfer(len);
				for(uint8_t i=0;i<len;i++)
					spi_transfer(((uint8_t*)packet)[i]);
#else
				for(uint8_t i=0;i<SI446X_FIXED_LENGTH;i++)
					spi_transfer(((uint8_t*)packet)[i]);
#endif
			}
		// }

#if !SI446X_FIXED_LENGTH
		// Set packet length
		setProperty(SI446X_PKT_FIELD_2_LENGTH_LOW, len);
#endif

		// Begin transmit
		uint8_t data[] = {
			SI446X_CMD_START_TX,
			channel,
			(uint8_t)(onTxFinish<<4),
			0,
			SI446X_FIXED_LENGTH,
			0,
			0
		};
		doAPI(data, sizeof(data), NULL, 0);

#if !SI446X_FIXED_LENGTH
		// Reset packet length back to max for receive mode
		setProperty(SI446X_PKT_FIELD_2_LENGTH_LOW, MAX_PACKET_LEN);
#endif
	 }
	return 1;
}

void Si446x_RX(uint8_t channel)
{
	SI446X_NO_INTERRUPT()
	{
		setState(IDLE_STATE);
		clearFIFO();
		//fix_invalidSync_irq(0);
		//Si446x_setupCallback(SI446X_CBS_INVALIDSYNC, 0);
		//setProperty(SI446X_PKT_FIELD_2_LENGTH_LOW, MAX_PACKET_LEN); // TODO ?
		interrupt2(NULL, 0, 0, 0xFF); // TODO needed?

		// TODO RX timeout to sleep if WUT LDC enabled

		uint8_t data[] = {
			SI446X_CMD_START_RX,
			channel,
			0,
			0,
			SI446X_FIXED_LENGTH, // TODO look into how packet length affects the FIFO for RX.
			SI446X_STATE_NOCHANGE, // RX Timeout
			IDLE_STATE, // RX Valid
			SI446X_STATE_SLEEP // IDLE_STATE // RX Invalid (using SI446X_STATE_SLEEP for the INVALID_SYNC fix)
		};
		doAPI(data, sizeof(data), NULL, 0);
	}
}

uint16_t Si446x_adc_gpio(uint8_t pin)
{
	uint16_t result = getADC(SI446X_ADC_CONV_GPIO | pin, (SI446X_ADC_SPEED<<4) | SI446X_ADC_RANGE_3P6, 0);
	return result;
}

uint16_t Si446x_adc_battery()
{
	uint16_t result = getADC(SI446X_ADC_CONV_BATT, (SI446X_ADC_SPEED<<4), 2);
	result = ((uint32_t)result * 75) / 32; // result * 2.34375;
	return result;
}

float Si446x_adc_temperature()
{
	float result = getADC(SI446X_ADC_CONV_TEMP, (SI446X_ADC_SPEED<<4), 4);
	result = (899/4096.0) * result - 293;
	return result;
}

void Si446x_writeGPIO(si446x_gpio_t pin, uint8_t value)
{
	uint8_t data[] = {
		SI446X_CMD_GPIO_PIN_CFG,
		SI446X_GPIO_MODE_DONOTHING,
		SI446X_GPIO_MODE_DONOTHING,
		SI446X_GPIO_MODE_DONOTHING,
		SI446X_GPIO_MODE_DONOTHING,
		SI446X_NIRQ_MODE_DONOTHING,
		SI446X_SDO_MODE_DONOTHING,
		SI446X_GPIO_DRV_HIGH
	};
	data[pin + 1] = value;
	doAPI(data, sizeof(data), NULL, 0);
}

uint8_t Si446x_readGPIO()
{
	uint8_t data[4] = {
		SI446X_CMD_GPIO_PIN_CFG
	};
	doAPI(data, 1, data, sizeof(data));
	uint8_t states = data[0]>>7 | (data[1] & 0x80)>>6 | (data[2] & 0x80)>>5 | (data[3] & 0x80)>>4;
	return states;
}

uint8_t Si446x_dump(void* buff, uint8_t group)
{
	static const uint8_t groupSizes[] = {
		SI446X_PROP_GROUP_GLOBAL,	0x0A,
		SI446X_PROP_GROUP_INT,		0x04,
		SI446X_PROP_GROUP_FRR,		0x04,
		SI446X_PROP_GROUP_PREAMBLE,	0x0E,
		SI446X_PROP_GROUP_SYNC,		0x06,
		SI446X_PROP_GROUP_PKT,		0x40,
		SI446X_PROP_GROUP_MODEM,	0x60,
		SI446X_PROP_GROUP_MODEM_CHFLT,	0x24,
		SI446X_PROP_GROUP_PA,		0x07,
		SI446X_PROP_GROUP_SYNTH,	0x08,
		SI446X_PROP_GROUP_MATCH,	0x0C,
		SI446X_PROP_GROUP_FREQ_CONTROL,	0x08,
		SI446X_PROP_GROUP_RX_HOP,	0x42,
		SI446X_PROP_GROUP_PTI,		0x04
	};
	
	uint8_t length = 0;
	for(uint8_t i=0;i<sizeof(groupSizes);i+=2)
	{
		uint8_t buff[2];
		memcpy(buff, &groupSizes[i], sizeof(buff));

		if(buff[0] == group)
		{
			length = buff[1];
			break;
		}
	}

	if(buff == NULL)
		return length;

	for(uint8_t i=0;i<length;i+=16)
	{
		uint8_t count = length - i;
		if(count > 16)
			count = 16;
		getProperties((group<<8) | i, ((uint8_t*)buff) + i, count);
	}
	
	return length;
}

// This can be repurposed for ISRs.
#if defined(ARDUINO) || SI446X_INTERRUPTS == 0 || defined(STM32L452xx)
void Si446x_SERVICE()
#else
// Disabled - AVR-Specific Macro
ISR(INT_VECTOR) // TODO: Change to STM32.
#endif
{
#if defined(ARDUINO) || defined(STM32L452xx) && (SI446X_INTERRUPTS == 1 || SI446X_INT_SPI_COMMS == 1)
	isrBusy = 1;
#endif

	uint8_t interrupts[8];
	interrupt(interrupts); // INTERRUPT TODO

	// TODO remove
	//SI446X_CB_DEBUG(interrupts);

	//printf_P(PSTR("INT %hhu/%hhu %hhu/%hhu %hhu/%hhu\n"), interrupts[2], interrupts[3], interrupts[4], interrupts[5], interrupts[6], interrupts[7]);

	// We could read the enabled interrupts properties instead of keep their states in RAM, but that would be much slower
	interrupts[2] &= enabledInterrupts[IRQ_PACKET];
	interrupts[4] &= enabledInterrupts[IRQ_MODEM];
	interrupts[6] &= enabledInterrupts[IRQ_CHIP];

	// Valid PREAMBLE and SYNC, packet data now begins
	if(interrupts[4] & (1<<SI446X_SYNC_DETECT_PEND))
	{
		//fix_invalidSync_irq(1);
//		Si446x_setupCallback(SI446X_CBS_INVALIDSYNC, 1); // Enable INVALID_SYNC when a new packet starts, sometimes a corrupted packet will mess the radio up
		SI446X_CB_RXBEGIN(getLatchedRSSI());
	}

//	// Disable INVALID_SYNC
//	if((interrupts[4] & (1<<SI446X_INVALID_SYNC_PEND)) || (interrupts[2] & ((1<<SI446X_PACKET_SENT_PEND)|(1<<SI446X_CRC_ERROR_PEND))))
//	{
//		//fix_invalidSync_irq(0);
//		Si446x_setupCallback(SI446X_CBS_INVALIDSYNC, 0);
//	}


	// INVALID_SYNC detected, sometimes the radio gets messed up in this state and requires a RX restart
//	if(interrupts[4] & (1<<SI446X_INVALID_SYNC_PEND))
//		SI446X_CB_RXINVALIDSYNC();

