njreichert/cdh-tsat6/cdh-tsat6-stm32project-nucleo/Core/Src/Si446x/Si446x.c
#if SI446X_ENABLE_ADDRMATCHING
	// Address match success
	// NOTE: This will still be called even if the packet failed the CRC
	if(interrupts[2] & (1<<SI446X_FILTER_MATCH_PEND))
		SI446X_CB_ADDRMATCH();

	// Address match missed
	// NOTE: This will still be called even if the packet failed the CRC
	if(interrupts[2] & (1<<SI446X_FILTER_MISS_PEND))
		SI446X_CB_ADDRMISS();
#endif

	// Valid packet
	if(interrupts[2] & (1<<SI446X_PACKET_RX_PEND))
	{
#if !SI446X_FIXED_LENGTH
		uint8_t len = 0;
		Si446x_read(&len, 1);
#else
		uint8_t len = SI446X_FIXED_LENGTH;
#endif
		SI446X_CB_RXCOMPLETE(len, getLatchedRSSI());
	}

	// Corrupted packet
	// NOTE: This will still be called even if the address did not match, but the packet failed the CRC
	// This will not be called if the address missed, but the packet passed CRC
	if(interrupts[2] & (1<<SI446X_CRC_ERROR_PEND))
	{
#if IDLE_STATE == SI446X_STATE_READY
		if(getState() == SI446X_STATE_SPI_ACTIVE)
			setState(IDLE_STATE); // We're in sleep mode (acually, we're now in SPI active mode) after an invalid packet to fix the INVALID_SYNC issue
#endif
		SI446X_CB_RXINVALID(getLatchedRSSI()); // TODO remove RSSI stuff for invalid packets, entering SLEEP mode looses the latched value?
	}

	// Packet sent
	if(interrupts[2] & (1<<SI446X_PACKET_SENT_PEND))
		SI446X_CB_SENT();

	if(interrupts[6] & (1<<SI446X_LOW_BATT_PEND))
		SI446X_CB_LOWBATT();

	if(interrupts[6] & (1<<SI446X_WUT_PEND))
		SI446X_CB_WUT();

#if defined(ARDUINO) || defined(STM32L452xx) && (SI446X_INTERRUPTS == 1 || SI446X_INT_SPI_COMMS == 1) // INTERRUPT TODO
	isrBusy = 0;
#endif
}
